app/Views/layout/sidebar.php

              ->get()->getRow() ? true : false;
};

$user_row = $db->table('admins')->where('id', $current_session_user_id)->get()->getRowArray();
---
SELECT *
FROM `admins`
WHERE `id` = '1'