app/Controllers/Invoice/Customers.php

SELECT *
FROM `customers`
ORDER BY `display_name`
---
    public function index()
    {
        $s = $this->request->getGet('search');

        $q = $this->m->orderBy('display_name');

        if ($s) {
            $q = $q->groupStart()
                ->like('display_name', $s)
                ->orLike('email', $s)
                ->orLike('company_name', $s)
                ->groupEnd();
        }

        return view('invoice/customers/index', [
            'customers' => $q->findAll(),
            'search'    => $s
        ]);