app/Controllers/Invoice/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `customers`
SELECT COUNT(*) AS `numrows` FROM `invoices`
SELECT COUNT(*) AS `numrows` FROM `quotes`
SELECT COUNT(*) AS `numrows`
FROM `invoices`
WHERE `status` = 'overdue'
---
    public function index()
    {
        $db = \Config\Database::connect();

        $periods = [
            'Today'        => 'DATE(created_at) = CURDATE()',
            'This Week'    => 'YEARWEEK(created_at) = YEARWEEK(NOW())',
            'This Month'   => 'MONTH(created_at) = MONTH(NOW()) AND YEAR(created_at) = YEAR(NOW())',
            'This Quarter' => 'QUARTER(created_at) = QUARTER(NOW()) AND YEAR(created_at) = YEAR(NOW())',
            'This Year'    => 'YEAR(created_at) = YEAR(NOW())',
        ];

        $stats = [];

        foreach ($periods as $label => $w) {
            $stats[$label] = $db->query("
                SELECT
                    COUNT(*) cnt,
                    COALESCE(SUM(total), 0) amt,
                    COALESCE(SUM(paid_amount), 0) recv,
                    COALESCE(SUM(balance_due), 0) bal
                FROM invoices
                WHERE $w
            ")->getRowArray();
        }

        $totalCustomers = (new CustomerModel())->countAll();
        $totalInvoices  = (new InvoiceModel())->countAll();
        $totalQuotes    = (new QuoteModel())->countAll();

        $overdueInvoices = (new InvoiceModel())
            ->where('status', 'overdue')
            ->countAllResults();