app/Controllers/Invoice/Invoices.php

    public function edit($id)
    {
        return view(
            'invoice/invoices/form',
            $this->formData($this->m->find($id))
        );
---
SELECT *
FROM `invoices`
WHERE `invoices`.`id` = '3'

    private function formData($inv)
    {
        return [

            'invoice' => $inv,

            'invoice_items' => $inv
                ? $this->im
                    ->where('invoice_id', $inv['id'])
                    ->findAll()
                : [],

            'customers' => (new CustomerModel())
                ->where('status', 1)
                ->orderBy('display_name')
                ->findAll(),

            'items' => (new ItemModel())
                ->where('status', 1)
                ->orderBy('name')
                ->findAll(),

            'taxes' => (new TaxModel())
                ->where('status', 1)
                ->findAll()
---
SELECT *
FROM `customers`
WHERE `status` = 1
ORDER BY `display_name`
SELECT *
FROM `items`
WHERE `status` = 1
ORDER BY `name`
SELECT *
FROM `taxes`
WHERE `status` = 1