app/Controllers/Invoice/Payments.php

    public function createForInvoice($inv_id)
    {
        $db = \Config\Database::connect();

        $inv = $db->query("
            SELECT
                i.*,
                c.display_name AS cname
            FROM invoices i
            LEFT JOIN customers c
            ON i.customer_id = c.id
            WHERE i.id = ?
        ", [$inv_id])->getRowArray();

        return view('invoice/payments/form', [

            'payment' => null,

            'customers' => (new CustomerModel())
                ->where('status', 1)
                ->orderBy('display_name')
                ->findAll(),
---
SELECT *
FROM `customers`
WHERE `status` = 1
ORDER BY `display_name`