app/Controllers/Invoice/Taxes.php

    public function index()
    {
        return view('invoice/taxes/index', [
            'taxes' => $this->m->orderBy('name')->findAll()
        ]);
---
SELECT *
FROM `taxes`
ORDER BY `name`