app/Controllers/Auth.php

SELECT *
FROM `admins`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function authenticate()
    {
        $session = session();
        $model = new AdminModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Database se user fetch karna
        $admin = $model->where('username', $username)->first();