app/Controllers/BaseController.php

    private function checkDomainExpiries()
    {
        $today = date('Y-m-d');
        $thirtyDaysLater = date('Y-m-d', strtotime('+30 days'));

        $expiryOrders = $this->db->table('orders')
            ->select('orders.id, orders.domain_name, orders.client_id, orders.domain_expiry_date, clients.client_name')
            ->join('clients', 'clients.id = orders.client_id')
            ->where('domain_expiry_date <=', $thirtyDaysLater)
            ->where('domain_expiry_date >=', $today)
            ->get()->getResultArray();

        foreach ($expiryOrders as $order) {
            $link = 'orders/view/' . ($order['id'] ?? 0);

            // FIX: ignore(true) ensures duplicate key error is bypassed
            $this->db->table('notifications')->ignore(true)->insert([
                'client_id'     => $order['client_id'] ?? 0,
                'user_id'       => 0,
                'title'         => 'Domain Expiring',
                'message'       => 'The domain (' . ($order['domain_name'] ?? 'N/A') . ') for client ' . ($order['client_name'] ?? 'N/A') . ' is expiring soon.',
                'type'          => 'expiry_alert',
                'is_read'       => 0,
                'is_admin_only' => 0,
                'link'          => (string)$link,
                'created_at'    => date('Y-m-d H:i:s')
            ]);
---
SELECT `orders`.`id`, `orders`.`domain_name`, `orders`.`client_id`, `orders`.`domain_expiry_date`, `clients`.`client_name`
FROM `orders`
JOIN `clients` ON `clients`.`id` = `orders`.`client_id`
WHERE `domain_expiry_date` <= '2026-06-20'
AND `domain_expiry_date` >= '2026-05-21'
INSERT IGNORE INTO `notifications` (`client_id`, `user_id`, `title`, `message`, `type`, `is_read`, `is_admin_only`, `link`, `created_at`) VALUES ('10', 0, 'Domain Expiring', 'The domain (www.sharma.com) for client asxcd is expiring soon.', 'expiry_alert', 0, 0, 'orders/view/36', '2026-05-21 11:21:46')

    protected function sendAutoExpiryEmails($forceOrderId = null)
    {
        $today = date('Y-m-d');
        $targetDate = date('Y-m-d', strtotime('+15 days'));

        // Agar specific order ke liye nahi hai, toh cache check karein
        if (!$forceOrderId) {
            $lastCheck = cache()->get('last_auto_mail_check');
            if ($lastCheck === $today) {
                return;
            }
        }

        $builder = $this->db->table('orders')
            ->select('orders.*, clients.client_name, clients.email_1')
            ->join('clients', 'clients.id = orders.client_id');

        // Logic sync: Agar manual store se aaya hai toh order ID filter lagayein
        if ($forceOrderId) {
            $builder->where('orders.id', $forceOrderId);
        } else {
            $builder->groupStart()
                ->where('domain_expiry_date', $targetDate)
                ->orWhere('hosting_expiry_date', $targetDate)
            ->groupEnd();
        }

        $expiringOrders = $builder->get()->getResultArray();
---
SELECT `orders`.*, `clients`.`client_name`, `clients`.`email_1`
FROM `orders`
JOIN `clients` ON `clients`.`id` = `orders`.`client_id`
WHERE   (
`domain_expiry_date` = '2026-06-06'
OR `hosting_expiry_date` = '2026-06-06'
 )