app/Controllers/Home.php

public function index()
{
    $db = \Config\Database::connect();
    $session = session();

    // --- [INTACT] Date calculation logic ---
    $todayObj = new \DateTime('today');
    $today    = $todayObj->format('Y-m-d');

    $expiry30Obj = clone $todayObj;
    $expiry30 = $expiry30Obj->modify('+30 days')->format('Y-m-d');

    $expiry5DaysObj = clone $todayObj;
    $expiry5Days = $expiry5DaysObj->modify('+5 days')->format('Y-m-d');

    // --- [INTACT] Auth Session Data ---
    $rawRole = $session->get('user_role');
    $userRole = !empty($rawRole) ? strtolower(trim((string)$rawRole)) : 'staff';
    $userId = $session->get('admin_id');

    $currentUserName = $session->get('name') ?: ($session->get('user_name') ?: 'Me');

    // 1. Total Active Clients Count
    $clientModel = new \App\Models\ClientModel();
    $data['all_clients'] = $clientModel->findAll();

    // 2. Total Orders Count for Card
    $data['total_orders_count'] = $db->table('orders')->countAllResults();
---
SELECT *
FROM `clients`
SELECT COUNT(*) AS `numrows`
FROM `orders`

        $builder->join('service_providers', 'service_providers.id = orders.provider_id', 'left');
    }

    $data['expiring_orders'] = $builder->groupStart()
            ->groupStart()
                ->where('domain_expiry_date >=', $today)->where('domain_expiry_date <=', $expiry30)
            ->groupEnd()
            ->orGroupStart()
                ->where('hosting_expiry_date >=', $today)->where('hosting_expiry_date <=', $expiry30)
            ->groupEnd()
        ->groupEnd()
        ->orderBy('domain_expiry_date', 'ASC')->get()->getResultArray();

    // 4. Critical Expiry Count (5 Days)
    $data['critical_expiry_count'] = $db->table('orders')
        ->groupStart()
            ->groupStart()
                ->where('domain_expiry_date >=', $today)->where('domain_expiry_date <=', $expiry30)
            ->groupEnd()
            ->orGroupStart()
                ->where('hosting_expiry_date >=', $today)->where('hosting_expiry_date <=', $expiry30)
            ->groupEnd()
        ->groupEnd()->countAllResults();
---
SELECT `orders`.*, `clients`.`client_name`, `clients`.`email_1`, `clients`.`phone`, `order_types`.`type_name`, `service_providers`.`provider_name`
FROM `orders`
JOIN `clients` ON `clients`.`id` = `orders`.`client_id`
LEFT JOIN `order_types` ON `order_types`.`id` = `orders`.`order_type_id`
LEFT JOIN `service_providers` ON `service_providers`.`id` = `orders`.`provider_id`
WHERE   (
   (
`domain_expiry_date` >= '2026-05-21'
AND `domain_expiry_date` <= '2026-06-20'
  )
OR    (
`hosting_expiry_date` >= '2026-05-21'
AND `hosting_expiry_date` <= '2026-06-20'
  )
 )
ORDER BY `domain_expiry_date` ASC
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE   (
   (
`domain_expiry_date` >= '2026-05-21'
AND `domain_expiry_date` <= '2026-06-20'
  )
OR    (
`hosting_expiry_date` >= '2026-05-21'
AND `hosting_expiry_date` <= '2026-06-20'
  )
 )

        ->join('admins', 'admins.id = daily_reports.staff_id', 'left');

    if ($userRole === 'admin') {
        $data['staff_activities'] = $db->table('activity_logs')
            ->select('activity_logs.*, IFNULL(admins.name, activity_logs.user_name) as staff_name')
            ->join('admins', 'admins.id = activity_logs.user_id', 'left')
            ->orderBy('created_at', 'DESC')->limit(10)->get()->getResultArray();
---
SELECT `activity_logs`.*, IFNULL(admins.name, activity_logs.user_name) as staff_name
FROM `activity_logs`
LEFT JOIN `admins` ON `admins`.`id` = `activity_logs`.`user_id`
ORDER BY `created_at` DESC
 LIMIT 10

        $data['daily_reports'] = $reportBuilder->orderBy('created_at', 'DESC')->limit(5)->get()->getResultArray();

        // [FIXED] Admin sees all leave requests with leave_name
        $data['recent_leaves'] = $db->table('leave_requests')
            ->select('leave_requests.*, admins.name as staff_name, leave_types.leave_name as leave_type')
            ->join('admins', 'admins.id = leave_requests.user_id', 'left')
            ->join('leave_types', 'leave_types.id = leave_requests.leave_type_id', 'left')
            ->orderBy('leave_requests.id', 'DESC')
            ->limit(5)->get()->getResultArray();
---
SELECT `leave_requests`.*, `admins`.`name` as `staff_name`, `leave_types`.`leave_name` as `leave_type`
FROM `leave_requests`
LEFT JOIN `admins` ON `admins`.`id` = `leave_requests`.`user_id`
LEFT JOIN `leave_types` ON `leave_types`.`id` = `leave_requests`.`leave_type_id`
ORDER BY `leave_requests`.`id` DESC
 LIMIT 5

    public function allReports() {
        $db = \Config\Database::connect();
        $data['daily_reports'] = $db->table('daily_reports')
            ->select('daily_reports.*, admins.name as staff_name')
            ->join('admins', 'admins.id = daily_reports.staff_id', 'left')
            ->orderBy('daily_reports.created_at', 'DESC')->get()->getResultArray();
---
SELECT `daily_reports`.*, `admins`.`name` as `staff_name`
FROM `daily_reports`
LEFT JOIN `admins` ON `admins`.`id` = `daily_reports`.`staff_id`
ORDER BY `daily_reports`.`created_at` DESC